tutorials/incompressible/simpleSolver/ras/ACCM_convexCurvature2D/0/omega
/*---------------------------------------------------------------------------*\
Caelus 9.04
 Web:      www.caelus-cml.com 
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 7747.333;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 7747.333;
    }
    left
    {
        type            empty;
    }
    outlet
    {
        type            zeroGradient;
    }
    right
    {
        type            empty;
    }
    top
    {
        type            omegaWallFunction;
        value           uniform 1;
    }
    wall
    {
        type            omegaWallFunction;
        value           uniform 1;
    }
}


// ************************************************************************* //
