tutorials/incompressible/simpleSolver/ras/ACCM_convexCurvature2D/constant/RASProperties
/*-------------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*------------------------------------------------------------------------------*/

FoamFile
{
	version				2.0;
	format				ascii;
	class				dictionary;
	location			"constant";
	object				RASProperties;
}

//--------------------------------------------------------------------------------

// For Spalarat-Alamaras Model, enable the below line
//RASModel				SpalartAllmaras;

// For k-omega SST Model, enable the below line
RASModel				kOmegaSST;

turbulence				on;

printCoeffs				on;

SpalartAllmarasCoeffs
{
    curvatureCorrection on;
}

kOmegaSSTCoeffs
{
    curvatureCorrection off;
    Cscale          1;
    frMax           1.25;    
}
